# SlabShapeEditFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SlabShapeFailures..::..SlabShapeEditFailed Property
BuiltInFailures..::..SlabShapeFailures Class See Also
---
Slab Shape Edit failed. [Description]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SlabShapeEditFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SlabShapeEditFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SlabShapeEditFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SlabShapeFailures Class
Autodesk.Revit.DB Namespace